# ip = [3, 10, 50, 60, 100, 100, 200, 300]
# ip2 = [[3, 50], [100, 200], [10, 60], [100, 300]]


for case in range(4):
    x1, y1, x2, y2, a1, b1, a2, b2 = map(int, input().split())
    if x1 < a1:
        r = [[x1, x2], [a1, a2], [y1, y2], [b1, b2]]
    else:
        r = [[a1, a2], [x1, x2], [b1, b2], [y1, y2]]
    # d - 공통부분이 없음
    if r[0][1] < r[1][0] or r[2][1] < r[3][0] or r[2][0] > r[3][1]:
        print('d')
    # c - 점
    elif r[0][1] == r[1][0] and (r[2][1] == r[3][0] or r[2][0] == r[3][1]):
        print('c')
    # b - 선
    elif (r[0][1] == r[1][0] and (r[2][1] > r[3][0] or r[2][0] < r[3][1])) or (r[0][1] > r[1][0] and (r[2][1] == r[3][0] or r[2][0] == r[3][1])):
        print('b')
    # a - 직사각형
    else:
        print('a')